{"podcast_details": {"podcast_title": "Jeep Talk Show", "episode_title": "Episode 868 - Jeep Girl Mafia", "episode_image": "https://ssl-static.libsyn.com/p/assets/7/d/a/9/7da92c1348e46b83e5bbc093207a2619/jts-logo-white-blackborder-1400x1400.png", "episode_transcript": " Set summer in motion with the most adventurous Honda vehicles yet, like the Passport and Pilot Trail Sport, and the Ridgeline, built for better off-road performance and engineered for more adventure. Summer is here. For a limited time, well-qualified buyers can get a 3.9% APR on a 2023 Honda Pilot, a 2.9% APR on a 2023 Passport, and a 0.9% APR on a 2023 Ridgeline. Buy online, reserved from select dealers, or visit your local Honda dealer today. See dealer for financing details. Hi, Jeepers! It's time for another Jeep Talk Show episode. Actually, I should say fantastic. We should really sell it. Another fantastic Jeep Talk Show episode. Another one. I'm Tony and welcome to the Jeep Talk Show where we put the fun in off-road fun. So, prior to the show, I was talking to the folks that are in the Zoom meeting tonight and one guy was asking, I think it was Rick from Arkansas, was saying, what was the FU thing you were doing in that one episode? You just kept saying FU, FU, FU. And I said, well, every time I see that fun in off-road fun here on the show notes that I'm reading, I think of the FU and fun. And he goes, oh, okay. And he laughed and he goes, you should mention that. And I said, no, no, no. You don't understand. The jokes are for my entertainment only. If you want to laugh along, that's fine. If you want to get the joke, you just got to listen to all the episodes. So this is the only show where you can hear Jeep owners talk about things about mud, rocks, and giant tires and not get weird looks. So strap in, strap on, grab your favorite beverage and get ready to laugh, learn and have a good damn time. We guarantee that after listening to that, she'll have that sudden urge to go and buy a Toyota or a Jeep. No. Probably a Jeep, but who knows. And hit the trails. Don't say we didn't warn you. On tonight's episode, we're going to be talking about Jeep Girl Mafia retail chain. So the Jeep girls are doing good. And what's up, Larry? Larry talks about going to the Toledo Jeep Fest. And then our must have for your Jeep, the is it wash on ocean? What's the consensus here? I think it's ocean KG 1000 P. W O U X U N. Damn foreigners. Wax on, wax off. The KG 1000 G plus GMRS base mobile two way radio. And damn it, it's not a base if you can't plug it into 110 volts. I mean, I'm sorry. It's just not. But anyway, no one said you couldn't. Oh, true. At least once. Are you ready? It's time for the Jeep Doc Show with hosts Tony, Josh, Wendy and Chuck. Well, howdy, it's Wendy. And have you listened to our Chick Chat episodes? It's on Mondays and only on the Jeep Talk Show. Hi, I'm Larry. And did we see you in Toledo? Did you see a lot of people that did you get much recognition for the Jeep Talk Show stuff out there Toledo? I'm expecting the answer is being no. So I'll just let you off the hook. Well, I'll just say this. One of the people there, one one of us there got a lot of attention. Stay tuned to hear more. So I just want to remind everybody about when he mentioned our Chick Chat episodes. So every other Monday, we have a Chick Chat episode and we got some great guests coming up. I believe our next guest is going to be Melissa with Oracle Lights. You know, the one that the same lights I have on the back of the Gladiator since that tree jumped out in front of me as I was backing up. Had to replace the lights. Yeah, they are. They're very nice. And John Lee actually on his trip to Arizona had a failure with with his some of the LEDs stopped functioning. I think he said he only had one LED light on his Oracle tail lights, but he's it's a warranty replacement. He's getting that taken care of. But it is something that we'll ask Melissa about because I've heard from several people about the Oracle tail lights having issues. So I'm sure they're addressing that and I think that'll be a great question to ask about. We'll see what the girls do because they're the ones in control of the questions. Going to be fun. What if the lights cause a locker issue? Oh, could be. Here we go. Poor John. That's a danger in sharing your information. So also to remind you guys about our Patreon channel or website that you can go to so you can get ad free content, exclusive content. And most recently, we've added a nice conversation I had with Greg Henderson of unofficial use only talking about lockers and when you can turn them on and off. Really back to the question, the thing you were just alluding to, Larry, about John accidentally engaging his rear locker while going down the highway at 75 miles an hour and then it not wanting to unlock whenever he realized what had happened. So I actually talked to Greg about that and you can hear that exclusively on our Patreon channel. It's up and available right now. So go over there, Jeeptalkshow.com slash contact and scroll through that page. Look for the Patreon and you can see how you can subscribe to our Patreon. And by the way, it only costs five dollars to get started. All right. So on the the ChickChat Girls type theme, Jeep Girl Mafia is now in bed with a retail chain, a big retail chain. Nice choice of words there, Tony. You mean they're working with them? Yeah. Good. It's not sexual, Larry. It's just that's when you get involved into the company, you're kind of getting in bed together. You're doing a business. You're having a good time. There's a herpes joke in here somewhere. So they are in bed or doing business with four wheel parts, a natural chain. I'm sure you guys have heard of four wheel parts. Larry, do you do much business with four wheel parts? No, I haven't. But I think they just restructured recently too. Don't they have a new owner now also? I don't. Four wheel parts? I don't know. Yes, I believe they do. Yeah, I think so. So this is great. They have a series of hats and shirts and various things there at the Jeep Girl Mafia that four wheel parts is going to be helping them sell. And you know, Wendy, this reminded me a lot of Julianne's Wrangle Her because she has a similar type thing. I know she's got all kinds of goodies that she sells at her different events and they're embroidered too, which makes them even nicer. You know, it's really cool. Yeah. Oh, Larry, did you see the hats, the Jeep Talk Show hats that Julianne did for the Talita Jeep Fest? Oh, yeah. She makes a lot of nice products and those hats look really nice. Yeah, that was done. She was actually late getting there on Friday because she was making those hats with her embroidery machine. They look good. Yep. We've already had a couple of requests about getting those hats, by the way. Yeah, they look good. I don't know if I want the pink letters on mine, but I think that's a simple change. Oh, she's chastised me about how boring the Jeep Talk Show logos are. She had her own made that were more colorful. She goes, she knows what women want. Can't argue with that. No, not at all. She's not wrong. Yeah. So I thought this was a great thing. And I think that just like the Jeep Talk Show and many other companies, they are seeing a very big opportunity partnering with women in the industry because there is nothing that says that jeeping and off-roading and you don't have to be jeeping. It can be Toyotas or any other thing. There's nothing that says that there has to be a male only event. No, it's amazing and I'm so happy for them. And Four Wheel Parts, they sell a lot of different products and it's going to be nice to see that is going to be represented there. But the Jeep Girl Mafia is going to be represented through that because they sell to the whole country. So kudos for them. They've done a great job. Yeah. And I think this is just another indicator that the things for all people are coming around. And I love seeing this because I don't know about you guys. I mean, I'm sure you agree, Wendy. I like seeing women off-road. Absolutely. I mean, we're always encouraging, you know, get out of that passenger seat and get in the driver's seat. Get out there and drive. Yeah. There's nothing. I mean, how hard is it to work a pedal or two pedals or even three? Well, it depends. But it's easy to learn. You know, how about that? Well, you've recently done welding, so anybody can do anything as long as they have the desire. This is very true. From a business standpoint, why exclude half the population? Exactly. Right. And I still say, and I'm sure this is sexist, but more likely to buy it if it's on sale. I mean, us guys will use that when we're telling our wife, but honey, it was on sale. That's right. I got a discount code for that. Yeah, but congratulations to Jeep Girl Mafia. Oh, and Wendy, maybe this will be a good opportunity to reach out to these folks and get them on ChickChat. I was already putting that down to reach out to Julianne and make sure that we reach out to them, because that'd be fun to talk about how that partnership happened and everything they have planned for. Well, they certainly should be recognized for this. And I'd like to know how it all came about. Is it something that 4WD contacted them about? Or was there a chance meeting on an off-road trail? Or you know exactly how this happens? Because I'm sure we're not the only ones that wonder how great things happen to great people. Well, not so great is the Chrysler recall of nearly 45,000 vehicles because interior trim may interfere with airbags. Boy, it's always something. What? Do you guys remember Rosanna, Rosanna Dana? Yes, of course. It's always something. You get punched in the head with a piece of trim as you hit somebody? So Chrysler is recalling 45,000 vehicles because the upper B pillar interior trim may not be fully seated, which could interfere with the airbag deployment officials said Monday. Chrysler recall covers certain 2022 through 2023 Jeep Wagoneer and Grand Wagoneer. So that's really Bill and John Lee, because John Lee has the Grand Wagoneer and Bill has the Wagoneer. But this is also the upper end of this vehicle, right? So this is, they've paid a lot of money for these vehicles. Yeah, they have to do this recall. And they don't want to be smacked in the head with the wrong piece of trim. Yeah, the wrong piece of stuff. So there's a total of 44,708 vehicles, according to the US National Traffic Safety Administration. A compromised deployment of sabanics, this is like the wash on thing, S-A-B-I-C can reduce occupant protection in the event of a crash, increasing the risk of energy, the injury. The NHTSA said, as such, these vehicles fail to comply with the requirements of Federal Motor Vehicle Safety Standard number 226 ejection mitigation. So damn, I mean, you can't just build something and you know, they don't have screws and stuff anymore. It just kind of pops into place. So is it a fitment issue or did the robot not smack it hard enough when it was putting the thing together? I don't know. But just that last paragraph that you tried to read was like, try it. I like that. Yeah, exactly. Well, I don't mean it in a negative way. No, no, I was struggling. A comprised deployment of the SABIC, what the heck that is, can reduce occupant protection. It's like some... Exactly. I'm like, just spell it out simple for us. Okay, so we understand. So full time job, technical writing or product management type stuff. Yeah. Seriously. Don't mess with me. I've been to college. Exactly. So, but it doesn't sound like it's... I mean, I know the airbags deploy. This is a side airbag. So I don't think necessarily... Maybe I'm wrong on this, but I don't think the side airbags necessarily deploy on front impacts. I think it's on the side impacts, isn't it? Yeah, I'm not sure. But you know, they obviously did some testing initially when they built this thing. So I would think that's probably an assembly issue more than anything else. You would think all that stuff went under testing to say, okay, let's go with this. Yeah. I mean, I think it would have to have had because they definitely don't want recalls. I mean, for the folks that have to go through the recall don't want it, but you just don't want the bad PR of the whole event. Exactly. Yeah, that's the big deal. PR. So the interesting thing here is that it doesn't say the airbag doesn't work. It just says you got... If I'm reading it correctly, if I'm understanding it correctly, you may get smacked with trim. Yeah, the trim hits you first. When the airbag deploys. Well, in my understanding, when that airbag hits you anyway, you're going to wish something else hit you because I understand it's very painful. What we need is not an airbag. We need some time dilation type technology. So the airbag can take its time. It can be a luxurious inflation of the airbag. It's soft as it hit my face. It was lovely. So Wendy, if you don't mind me asking and you can answer pass, how tall are you? Five, seven and three quarters. Okay. So you're relatively tall. You're not in danger of having your neck broken by an airbag deployment. I hope not. I think you're in the five, two, five, three range or maybe less than five, two. You're right. If you sit lower, that makes sense. Well, I mean, it's just because of the size and the density of the bones and everything because the smaller women have a potential of being injured severely by airbags being deployed. This is from several years ago. They may have made some changes, but I remember this was a story five, 10 years ago. So I wonder what that means is for all they really all the airbags because people come in different sizes and shapes, shapes. And you always get kids in the backseat, too. I don't know if those I don't know if the side airbags turn off like a front seat does. But if you have if you have a child back there, obviously not in the car seat, but, you know, just sitting there all sudden side impact. You get a piece of trim coming at you. And, you know, not to saying that it would injure a dog, but you have to be concerned about dogs, too, because dogs are not required to be cinched in or anything. Whenever you traveling with with Duke, you know, I just thought about this in a rollover or head on collision. Duke could become a projectile, couldn't he? Yeah, he's clipped in. No, that's the key reason why that's key reason why he wears the vest. He's clipped in and tethered to the seat belt. Oh, very nice. I'm glad you're doing that. That's that's great to hear. I didn't expect that. Yeah, hundreds, hundred six pound projectile is no fun. No fun for him either. No. There's just so much we you can have before impact. Exactly. Well, anyway, so this if you have a grand Wagoneer or a Wagoneer, your vehicle may be included in this recall. And it said not all. So it's interesting, too, that forty five thousand of those things have been sold. More than that. Yeah, more than that. Oh, and by the way, I did ask Bill. Bill has the Wagoneer and he towed his 392 JLU to Arizona last week, week before last. And I was really curious how that that Wagoneer towed. It was a breeze. Had lots of power. He said, I think it was better than his Ram 1500. The towing ability was better than that. And it was a luxurious ride. And for Easter Jeep Safari 2024, I believe he is planning on towing the the 392 to Moab. And so I'll get to see it in person. So they said it a good job. Yeah, it's it's great to hear. I like it's not a vehicle that I would necessarily want to purchase, but I'm glad Jeeps getting into the larger vehicles, the more suburban like vehicles, if you will. And I still think they're probably made a lot better than the GM products. Welcome to Fabricating Frenzy with Larry, also known as Jeeping Mo, whose hair is not curly. So last week and we went to Toledo Jeep Fest and, you know, we were Duke and I were there and we met up with quite a few of the Jeep talk show crew there and we were just walking out of street and looked up. Said hi to Nicky G. He's walking towards me. We spent the whole day with Nicky, Chris, Chip and quite a bit of the day with Julianna as well. But it was a really good turnout, the event, and you could just see the amount of work that they've put into that. It definitely paid off. So Chip, I don't know if we were going to talk about this or not, but Chip and his wife actually did a little work there for Wrangler Her as I heard. Yeah, she worked. They worked the booth or something for like an hour and a half to help her out. Yeah, may have made the joke a couple of times that they're going to come back and find Chip in a cut off Wrangler Her shirt. A midriff. Yeah, that would be good to post. I'd like to see that. Yeah, nothing says Wrangler Her more than a booth full of guys. I'm just saying. Yeah, but you had Duke there. He had to be bringing all kinds of people in, huh? Well, you know, so Duke had his own little QR code that we put on there and no one really knew what that was about because he had the QR code and we had a GoPro on him for Duke cam. And there was probably no less than a dozen scans at a QR code because we'd be standing there all the time, I'd catch out of a corner of my eye someone scanning the QR code on his back. I love it. That's perfect. Oh yeah. And they're disappointed there wasn't more Duke information. Well, then he had a lot of people saying, is this a TikTok thing? What is it? So, you know, I explained to him about our YouTube channel, Jeeping Mo, how he's part of it. He's also part of the Jeep talk show. And yeah, the fact that it was on his back was just, you know, just scan me please. Everybody was all over that. I love it. That's a great idea though. Well, yeah, that's what I said. He got more attention and more everything than pretty much all of us combined. And he got fed up properly for it. I love it. That's great. Go ahead. I was going to say, I understand that there's a pretty big parade that happens at that Toledo Jeep Fest. Yeah. So Chris, Nikki and I, we watched a lot of it. Julianne actually had her Jeep in it. There was even an impromptu Jeep stacking followed by a marriage proposal right there. They caught that on live news. Wow. And then the Shriners, they had all, you know, that parade went on. If you told me it went on for two hours, it wouldn't surprise me. Well, and I think one of our listeners said there was what, over 1,500 entries of all different ages, styles, built up, stock Jeeps. Nothing but Jeeps. I was watching it live on Facebook from the Toledo Jeep Fest people. And I believe it was Kevin who we've dealt with in the past with Toledo Jeep Fest. And he kept complaining about people throwing candy. I told them not to bring candy. Oh no. So if you show up with a box of candy to throw to the people at the parade, what are you going to do? You're going to listen to Kevin telling you not to throw the candy or you're going to throw the damn candy? Yeah, that's all part of what the crowd's looking for. Well, while we were there for the parade, just about every Jeep is throwing candy. If that was not supposed to happen, no one got that memo. He said it multiple times. I told him not to throw candy. All they heard was throw candy. Exactly. Don't be so negative, Kevin. Right. So we walked around the whole show. We talked to quite a few of the vendors out there. We spent some time with the Arma-Lite guys. Oh, I love that product. I would love to have that in my wife's TJ. It's really nice. I think Bill bought us that at Easter Jeep Safari. And you never really get to appreciate just hearing about something until you physically see it and how well it's made. But that flooring system, they really did an outstanding job on that. When you see it actually installed, I haven't got to see Bill's install. But Arma-Lite did a really nice job on that flooring because sometimes when you think aftermarket flooring, you're thinking it's somewhat loose and you got to tuck it in here and tuck it there. But it's all molded for that floor. It's a really nice product. I mean, just not stinking once you've got water in the vehicle is a big seller for me. If you've ever gotten water in your Jeep and had to pull that stuff out and let it dry and then it still smells moldy and oh, it's horrible. I actually got to see, not an install, but they had samples at the booth, Arma-Lite booth at EJS. So that's one of the reasons why I'm so impressed with it. It sounded nice. It looks nice online. But seeing it in person and seeing the thick and the backing and all that stuff, it's really tough looking stuff. Oh, yeah. Yeah. So we got to do an interview with them for a video that will come out this week. And the other one was Racing Optics, which is a product I've been wanting to run. Eventually, I got to get rid of the shattered front window. And so it's a tear off system and it's got three layers and it's supposed to stop impacts, at least get into the glass. It's supposed to take most of the abuse on the outer layers. It's like a bubble wrap, but you can still see through it. And Larry, let me just remind you real quick. When you say we're going to have a video, make sure that the listeners understand that it's not the Jeep talk show that's going to have the video that Jeeping Mo is going to. Because they're going to go over to Jeep talk show YouTube channel and go, where the hell is it? Where is it? He said it was going to be there. Right. So we go to just about all the events under Jeeping Mo and Jeep talk show, but we put videos out under Jeeping Mo. It's MO. And so there's a lot of events and how to videos and fabrication. But so the one for Toledo will be there. But the one thing nice about it, so if you think about how a visor works when they're racing, how they peel off each layer to get a fresh one, that's how their window system works. And we got to talk to the Skinny Guy Campers who was on the channel as well. So we got to see that's that is a really nice camper. But there was a lot to see and do there. The inside section of that. So that unicorn Jeep truck we talked about several episodes ago. Yeah, I didn't get to see it, but I seen some of Chris's photos that was there. Yeah, I thought that was cool. Yeah, I remember you and I had talked about, you know, I wonder if they knew about that. But yeah, it was there. And I know Chris got to spend a lot of time talking to Jerry and Whitney. And yeah, there was a lot of it was a lot of vendors, a lot of people. You know, the one thing I really like is when I go to a show and it doesn't have to always be about wheeling. It's always nice when you go to a show and you just kind of feel the love for the vehicles and you know what they're doing. You know, not every event has to be, you know, EJS out on the trails because there's a lot of people there who may never go trail riding. But the passion for the Jeep was definitely there. And that's interesting thing too. You do not have to be an off road Jeeper to enjoy and be a part of the Jeep family, to be a part of and have that enthusiasm and love for the Jeep. Because you can there's nothing wrong with driving a Jeep on the street every day. I mean, you're still the Jeeper, right? That's right. And you know, there was I'd actually seen a couple of Jeeps there I've never seen before. So there was a there was an old CJ there that was a tow truck. Oh, yeah. Yeah, it had a little bitty. I mean, I doubt he's picking up my vehicle. But that's what I'm thinking. Yeah. And there was and there was there was even Santa Claus there. I saw that. I mean, oh my gosh. I mean, Santa Claus is supposed to be Christmas in July, not August. Yeah, you know, you got to start. You got to start early sometime. Yeah, he had a sleigh on the back of an old Willis truck. And yeah, it was kind of nice. We was in the they call it a park and shine. And I'll suggest I'll assess anybody who wants to go there. It was only thirty five bucks this go around. You park on one of the main streets there. You're kind of just off to the edge of the main show. But thirty five bucks, you got parking, you get a little swag bag, you get all the ducks you want after you're done. You're going to pay for parking somewhere. So be part of the show. Yeah. Did you did you happen to see Allison from the ducking Jeep official ducking Jeep established 2020? That's how it is on on their Facebook page, by the way. No, no, I look for. But there was just so many people going to so many different directions that, you know, we didn't we didn't get to run into her there. I was kind of looking forward to, you know, getting some photos or doing an interview with her, too. But yeah, we didn't get to talk to her at all. But we did get on one of the main channels here in Toledo. So ninety three point five WQRN, I believe it was. Yeah. So Chris had talked to Whitney, who Whitney, you know, obviously the one who helped set up the whole event. Yeah. Her and Jerry, the main people that right to lead us to set up and running. She said that that Braydon Stations was looking for people to interview. So off we went. Chris left while Whitney was still talking. I got to go find it. I got to go do it. You know what? Chris is really good at what he does because he grabbed the mic and the way he goes. And, you know, him, Julianne and I and Nikki G. we we did a little interview there and it was live on air. And it was obviously broadcast all over the the event as well. So, yeah, it was a lot to see and do. A lot of a lot of people to talk to, a lot of events. And you could tell that Julianne knows all the vendors. Right. She does that. She does so many different shows, too. You know what she is. You could tell she puts in the time and the labor to to, I'll say, nurture those relationships with all the vendors, because that doesn't just come out of just, oh, you're here. So, you know, we'll talk to you. You can tell that there's a there's a lot of legwork and put in there. So kudos to her for that. Because there's only been a few episodes of ChickChat, but you hear that from the people that she knows that that her and Wendy are interviewing. There is a deep relationship between her and those people. Yeah. Right. And, you know, you guys all know from being in other facets of business, you have to put the time in to get those relationships. You don't you don't get that just for showing up. Right. So, yeah. Yeah. We walked around and she was introducing quite a few of the vendors to Chris and I and trying to work on some more interviews for the show. And, yeah, and all the time we're going through and watching everybody scan the QR code on Duke's back. And yeah, it was really good time. So side note, I was telling my wife about Duke and how you had said Larry said, oh, make the Jeep talk show badge with the QR code and stuff. Just I'm going to put that on Duke. Hope you don't mind because Duke is going to get a lot more attention than I will. Absolutely. And I thought about that. I was so it's brilliant. Of course you will. And my wife suggested have a new grandbaby, Winston. He was born just maybe three weeks ago and she recommended that I put a QR code on a onesie for Winston. So whenever he's out, so whatever he's because that's the only other thing that's going to get as much attention as a dog. It's a brand new baby. It's a brand new baby. And I said, oh, wow, I'm monetizing my grandson. Hey, whatever it takes, we've got to do it. Right. That's right. Business is where you find it. Good business is where you find it. So so we've been editing, editing the Duke cam video and well, it's there you're watching you watching the how the show looking through Duke's eyes. And well, I'll just say as you get everybody's backside and well, I was just going to ask, is there any retarded butt, butt smelling in this video? Yeah, you know, you look at it. I'm thinking of other dogs, but I'm not sure. Yeah, I'm not sure. Let me think about that. Did you go to the the the the vendor event? I know Chris and Julianne went and they they got to sit and listen to Jeremy Rowe and his band perform. No, we didn't go to that. So we walked around the the show from eight in the morning till about six. And by that point, we were pretty well spent. Yeah, that's exhausting, by the way, if you've never done a trade show, either you're working the booth, doing the trade show or you're walking the shows. It is a lot of work. It's exhausting. So how does how does Duke let you know that he's ready to go back to the hotel room? Does he just lay down and you have to drag him? Yes, he's dragging him along. You know, he's he's always been a trooper. You know, he'll just keep going along. And I've really never had many issues with them, although I figured by the time I'm kind of getting sore and tired, he's either there or ahead of me. One of the two. Yeah, but they have a little did he have a little boots on? I think you said something about he actually got his his feet burned and bleeding one time from the heat from the stuff that he was walking on. Did you do have a little boots on him? Well, luckily, it really wasn't that hot. There was only like in the mid 80s. So we had really good weather for us. I didn't have to put those on them because it was last year when it was around 100 degrees. We stepped out. That was we'd taken him to the dog park to run around and it was the pavement going to and from the Jeep. His feet were actually bleeding from that. I know it's quick. It's quick. People don't realize that dogs are very sensitive to that. Right. Yeah. And then, you know, we got we went down there to also see. So Chris actually camped right by the event. So, you know, there's a live in a van down by the river joke in here somewhere. But the bridge going in Toledo under that, there's a grass section and they were written out camping spots. And he he camped out underneath the bridge there. And while it might be something that good there, I wouldn't do maybe in St. Louis. But yeah, it was a nice area. It was a nice spot. I saw some pictures. It was nice. I haven't put up, but I got some pictures from Chris of that. And he was he was right next to the skinny guy camper. My people actually spoke with him on the phone a little bit. I told Chris when he was talking to him and he was talking to me on the phone. I said, ask them how much it how much they charge to touch the skinny guy campers, you know, at thirty thousand dollars. And he had me on speaker. So the guy heard me and was talking about. Oh, no. Yeah. Which is fine. And he was wanting Chris to repeat it. And he says, we're also selling tickets to look at it. Oh, just to look. Yeah, they are nice tents. Oh, they're really nice. But, you know, that's the one thing. So I've been to Toledo twice now. And, you know, you go into some downtown areas and some areas that you wouldn't think about walking around during the day or night. And some areas are really nice. But Toledo downtown and that section, at least, you can tell that it's a really nice, well-kept. You know, you didn't see. You know, I don't know how to say this. You didn't see a lot of people just laying around on the corner or anything like that. Well, that was the cool thing, because even in Austin, I mean, I remember driving through Austin going to Hidden Falls. I was surprised to see such a huge population of people camping out underneath the the overpasses and the turnarounds. So I think it's one of it was well-kept. It was manicured. The grass was manicured. And it was just I mean, it was right under a flyover. But that's not a problem as long as nobody flies off of the flyover. And it looked like a nice place. So, yeah, it was it was great. I kind of felt bad about Chris. And you're right. He needed to be in a van for it for the joke to work. Right. But, yeah, overall, once again, I think Jerry Whitney and their team did a great job putting all that together every year. Yeah. Oh, and we got a lot of a lot of good, great Jeep talk show related stuff. They put up a Jeep talk show flag that I know you took a picture with. I saw that. Yeah. We were on some of their advertisement. I can't remember if Chris told me we got on on some of the Toledo Jeep press shirts, I believe, and the Jeep talk show logo. So they really supported us last year and this year. And we really appreciate it and spent time talking to you guys. Oh, yeah. Yeah. You can't you can't really ask for much more. They did a great job with all of that. Oh, did you guys get to see any of or listen to anybody that was speaking? I know Patty Upton, who we've had here on the show that did that great off road adventure with her her husband that recently passed away. She was on the show and she was there doing a talk. No, I didn't get to listen to any of that. We broke away from the group for a little bit while I went off and did interviews with people for our YouTube channel and then trying to catch up with Chip and everybody. They were in there listening as Jerry was starting to was just finishing up his talk. So I never did get to listen to anybody inside. But I can imagine it was pretty good. That's Jerry Huber. Huber, right, right. Former Toledo Jeep plant manager. Now you'd seen him all running all over the place in his golf cart. Yeah, he told me I got to talk to him on the phone a little bit while he was talking to Chris. And he told me he was just getting back from the golf cart as he went to go retrieve his red Jeep talk show hat. There you go. Yeah, I'm sure you had to I'm sure you had to either charge or fill it up a couple of times. So yeah, it was great. It sounds like a really fun event. I wish I could have made it. Yeah, I look forward to going again next year. It was a good time. And I think everybody, especially if you're if you're into Jeeps, I mean Toledo, that's the place to go for Jeeps. And oh, did you I know Chris told me so I'm thinking, you know about it. Did you did you hear the thing about the the the misdirect the bad directions for getting the picture in front of the Jeep talk show? I'm not sorry. That would be nice. The Jeep big Jeep logo at the Toledo Jeep plant. Yeah, it was like four. It was like four thousand something. But the misdirect was four hundred. So everybody got steered to a lesser area. I'll just leave it at that. Chris said that told me as when he was telling me about he goes, it was in front of a crack house. Well, you know, my question, my question was, well, did they still get the picture? That would be a member one. But anyway, I think they were like 30 minutes late getting to the the photographer at the Jeep sign. Right. But because they had gone to four hundred instead of four thousand, whatever the street is there. Yeah. Then it was the next day was Chip and his wife who got that picture. And then the next day that they actually did that mile long walk and got that pretty cool little that that badge. Well, it was the shape of a Jeep was all metal and have duck on the front and lit up. They got that for walking that mile on Sunday morning. Yeah. Yeah. It was a really good event. They had things for the kids. I remember talking about Jerry and Whitney here recently before the event. I have them here on the show for interviews that they were doing a lot more things for kids this year, including having little Jeeps that they could drive. Yeah. Then inside there was a whole RC car thing for the for the kids. I'm thinking that a great photograph or video opportunity would have been Julianne and all of her four foot eleven self getting in one of those little Jeeps and driving. Yeah, that would have been a good photo. Yeah. Sorry, Julianne. She's used to it. Oh, yeah. She'll punch me next time and I have black. Yes, she will. Black and blue kneecaps. Get it. But I'm curious to who sold merchandise her chip. What was it? She said, I think she talked about it. I don't know if she talked about it here on the show or not, but she did really well. I think she said she sold out or came really close to it. Yeah. Well, you know, we were standing there and it goes right back to the same old most of those things are geared around the male population. But so when so when a lady is set up to sell to the women, it really stands out. So about every lady who walks past her booth always they all stopped in for the look around or to buy something. So, you know, it's this is this is like this. This is like the story with the Jeep girls, my mafia thing. There is a market for this stuff. Right. And and the women that take it upon themselves to get out there and do this stuff thing are I think are going to be very successful. Yeah. And she she's very I'm going to say she's very out there. Right. She's not afraid to talk to people. She's not afraid to to do any of that, which is a big part of that, too. She had a very, very bubbly personality, very, you know, forthright personality that really helps that. But, Larry, you mentioned the video that was shot whenever Chris was on the radio station. Julieanne didn't say a damn thing. She was she was in the shot. Yeah, but Chris had the mic the whole time. Right. But, you know, you know, Julieanne's there's nothing to keep her from grabbing the mic and talking. And by the way, you can see that video there that we do have that video so you can see what what's on the video and hear the words that Chris said there. It's on the the Facebook Jeep Talk Show Facebook page. We also have it on Instagram. I think it's a real that's there and you can you can find that or a story on Instagram and also to available on the Tic Tac. So those are shorter versions on Instagram and Tic Tac. But the full version. Oh, and of course, YouTube. So just just go and look at Jeep Talk Show and you can watch that video. I thought it was very entertaining and it was so wonderful having all you guys going out there and supporting the Jeep Talk Show. It was amazing. A live Nicky G joke. Yes, we did. A lot of fun and I am really looking forward to seeing you guys out at the Great Smoky Mountain Jeep Invasion, which is good Lord. It's it's probably just happening within a week after the publication of this episode. It's coming up very fast. And I believe you told me the first time we met in person, Larry, which was at the Lone Star Jeep Invasion and Conroe, Texas. They say Houston, but it's really Conroe. I believe you told me when I asked how this was because I had never been to an event before because we just don't have events in Texas. And I believe I asked you how you like this event. You know, it's nice. But I believe you said the Great Smoky Mountain Jeep Invasion is five times seven times bigger than this. Oh, yeah. Yeah, we can remember to. That was what the second time the Lone Star Jeep Invasion had ever been put together. So it did. It hasn't been around as long as some of the others. So, you know, next year, I'm sure it'll be even bigger. Sure. But I mean, the point is a really big Jeep event is coming up. And this is going to be another one of those like similar to the Toledo Jeep Fest. It's not off-roading. It's really just a walk around, look at the Jeeps and meet people and see vendors. Oh, absolutely. That's a huge event. And there's every bit as much going on outside of it as far as why you don't have the actual parade like Toledo has. The main drag right there that runs in front of everything. It's nonstop with Jeeps. So it's kind of like a parade. There's a still parade on the sides and then the Jeeps driving up and down the streets type of parade. Yeah, no one's throwing candy, though. Well, not officially. Not officially. So I'm really looking forward to that. You're going to that. You believe you're going to be going to that one. I believe Chris is going to be there. Julianne with Wrangle Her is definitely going to be there. She is going to be at the Maxxis Tire booth arena. I don't know whatever they call it. She's going to be there with her Wrangle Her Jeep and she's going to be sporting a, unless they tell her no, she's going to be sporting a nice three by nine Jeep talk show banner. Nice. She's going to be there. Yeah, we really, really appreciate that. And actually she just received that banner yesterday, I believe. So looking forward to getting some clicks and some views and hopefully she'll get a lot of, what's the Jeep talk show? You know, she was flying that the flag that I carry everywhere. We actually put it in her Wrangle Her booth. I saw that. Thank you. So that flag has been all over this country. California too. Oh, and Chris called me and said, hey, should I grab the five by eight flag, I think it was, that we sent to Toledo Jeep Fest? Should I grab that? And I said, yeah, sure. I said, if nothing else, they won't have to search for it next year because it was actually last Toledo Jeep Fest, the one before this most recent one, that I sent them the flag and they were kind enough to put that up. And they had that, they actually hung the flag in the area where you registered for the parade and did the silent auction. Did you try any of the silent auction things, Larry? I know you were in that area with Nicky G. No, I didn't do that. Set summer in motion with the most adventurous Honda vehicles yet, like the Passport and Pilot Trail Sport, and the Ridgeline, built for better off-road performance and engineered for more adventure. Summer is here. For a limited time, well-qualified buyers can get a 3.9% APR on a 2023 Honda Pilot, a 2.9% APR on a 2023 Passport, and a 0.9% APR on a 2023 Ridgeline. Buy online, reserve from select dealers, or visit your local Honda dealer today. See dealer for financing details. So it was a good place for hanging the flag and it probably needed the QR code, but you know, it's all, hindsight is always 2020. Right. How long of a trip is it for you to get the Great Smoky Mountain Jeep Invasion? That's a longer trip than Toledo, right? I think it's about the same. It's about seven-ish, somewhere in there. That's a long drive, but you're like a truck driver. You don't mind driving those long distances. He has Duke with him. He can do it all. He's got mandatory P-brakes too. That's right. There you go. So if you're curious about the Great Smoky Mountain Jeep Invasion, we interviewed Justin, who is the main guy behind the event for, gosh, 12 years or whatever it's been running. So you have two episodes. You can get more information about this from Justin. Episode 806, which was in May, and episode 842, which was in July. So I highly encourage you to go listen to that. And there was a little more hard-hitting questions about like cheap break-ins and the security and stuff that they have on all the parking lots. So if you were concerned about putting your dear, beloved Jeep out where people could mess with it, I think you'll enjoy hearing all the security that they have for those vehicles there on episode 842. Right. Well, great job. And again, thank you. And please thank Duke for me for going out there and helping support not only the Jeep Talk Show, but Jeep and Mo. And of course, go to YouTube and just do a search for Jeep and Mo. And I think you will find all the videos that Larry was talking about. And of course, you have to keep checking because Larry puts out videos. You put a video or two out every week, don't you? Every week, yeah. We try to do at least one, what I call long-form video and several short-form videos and periodically a Tool Time Tuesday or something like that. So we kind of mix it up, a Tool Time Tuesday and Weld Wednesday, depending on what we have. Tool Time Tuesday is fun because you pick out tools. And I like to think that I use a lot of tools and know a lot about various tools. But you come up with stuff that I'm going, what the hell, man? I didn't know that existed. Yeah, I need one of those. Oh yeah, because the right tool makes things so much easier. Now, finding it is another thing. That's a whole other volcano. I mean, even when you own it, finding it is the other thing. I spent 30 damn minutes looking for that thing, but then it made the job 15 minutes quicker. And that's typically why I have one because I've seen something very similar to it. Yep. Well, I wanted to share a little off-road adventure. We had a student who had a Grand Cherokee 4XE. Oh, wow. Yes, first one that we got to take through the paces and teach them all that they needed to know. They were great students. And they were running back and forth to Starbucks, bringing you guys coffee. Is that what they were using it for? No, no. This gentleman came and he wanted to learn everything he could about off-roading. We got done and he had no idea that that vehicle was that capable. So a couple of cool features. Obviously, it's 4XE, so it does have that electric. What did we do on episode 866? Was it about 12 miles? It'll go? 20. 20 according to that. Oh, I'm sorry. How dare you? Yeah, let me get the numbers you got. Geez, don't be cutting it short. But it was interesting because we're used to teaching all different levels of experience and different kinds of vehicles. And so this vehicle pulls up. Of course, we need to kind of learn some things. And two things that stood out was interesting is that when you're sitting in the seat, of course, it's luxury. It's a Grand Cherokee. It's beautiful inside. But there's a lot of different things. It's like a knob that turns to be able to put it in sport mode, auto mode. There was a rock mode, snow mode, and sand, I think, which was interesting because what does that actually mean? Obviously, it's going to be gearing. We're used to put it in four high if you're in sand and mud and put it in four low if you're crawling. I mean, that's kind of what we do, right? Mechanical, damn it. I want to be able to jerk on that thing and wonder why it will not go into four low until I jerk it hard enough. It's mechanical, damn it. The transfer case lever there. Yeah. So it does have that independent front suspension. So that's different, but different because there's no... Their clearance underneath is pretty even. There's nothing hanging down to really get caught on things. Well, when you put it into rock crawling mode, because we did do some rocks and get him kind of understanding it, the vehicle actually lifts. It's about three and a half inch lift. Wow. Literally with the airbags, you could see it just like, you're going, well, now this is pretty cool. That would be handy going through a drive-through. Yes. Hang on, coming up. Can I hit it twice? Yeah, exactly. But it kind of reminded me of the Rivian. We talked about that electric, full electric truck had a 15 inch lift. This is about a three and a half, but it was enough to give him additional clearance because at first we're looking at it going, okay, well, we need to be careful on the path we pick. And he doesn't have rock sliders and he doesn't have skid plates underneath. So obviously we're not going to put him through something like that. But I was very impressed with that vehicle. Of course, it's a Jeep. I would highly recommend it for anybody who wants to do basic trails, wants to get out with the family. You know, you can use the electric part when you need it for in town, but gas mileage was good. So it was really a nice vehicle. And I'm very impressed. Just the fact that it had those sort of creature features. It would be hard and get used to that sort of knob to put it into the snow mode or the sand mode because I'm not used to that. But it was great. He did a great job. And anyway, I just want to do a little shout out for it. I know on 866 we talked about the Grand Cherokee 4XC as far as charging it. But we actually got to see it in person, working, doing everything. It did the whole trails that we do for any other person, even a stock Jeep. And it did everything perfectly fine. It climbed, it had torque, it did everything. So kudos. Great vehicle. That's the ideal overlanding rig. You can load all your stuff in the back of it. You got all that room. Yes. As long as you're doing like fire trail, fire roads and some gravel roads, maybe some not real crazy rock. But you can get around very well. A ton of room for all your overlanding stuff. And since that's actually a metal chassis, you could always throw their rooftop tent up top. Yep. The one thing I didn't like is you really couldn't upgrade the tire size. Because in the front, the way they have the suspension, it actually, I don't even how to explain this visually, but it actually protrudes kind of over the tire. So there's no way for you to do a bigger tire. So we were looking at it too, that maybe, I think it had 18 inch rims, maybe going down to a 17 inch rim would give them a little bit more sidewall to be able to air down a little more. So they were on, gosh, I can't think of the tire now. So we took them down to about 25 because there wasn't much sidewall to be able to air down like we normally would. And it made a huge difference for them. We also did partway through, took and disconnected the sway bar. And that also made a difference for them riding inside. So it was good. But that would be the only negative I would say is that you couldn't go to a bigger tire. Which I think would be awesome. And that's the downside of the non-rangler, non-gladiators is the aftermarket, the things that you can do to it. And not to say that they couldn't have a big aftermarket for off-roading Grand Cherokees, but there's not a lot of people going to do that. Yeah, you're going to have to change that front somehow probably to do a bigger tire. But he could go down. And again, we were looking at the brake calibers too. There may not be room to go to a 17 inch. Right. So that was the other thing was like, ah, you're probably stuck with that. So we did recommend going to a Falcon Wild Peak ATX tire for the off-roading that they want to do. I mean, certainly we did kind of some medium trails with some good size rocks. That car was fine. So I could say easy to medium, not a problem. Maybe rock sliders down the road if you're going to do more of that stuff. But it's the tires, they would need to upgrade the tire quality just to be able to handle more of that kind of stuff. Does the Grand come with tow points? Yes. Two in the front and one in the back. Perfect. I would think anything with the name Cherokee be well acquainted with Sawzalls. Yeah. Well, you know, and the neat thing is, is they can use this Grand Cherokee to drive down to a dealership and buy a Wrangler or a Gladiator. And then they have a vehicle that they can heavily modify or just get a used one and use it for off-road. But honestly, for what I just described, basic trails, even into some medium, this car is more than capable. No, but I mean, if they really got hard, willing to do hardcore. Yeah, he'd have to upgrade a Wrangler. There's, you know, if he wants to get into serious rock crawling, you know, because the problem is you can't get a good tire that you would need to be able to grip and handle that type of stuff, you know, for crawling. So other than that, I think the vehicle would be more than capable to do rock crawling. You just would need to do some changing. Yeah. If you want an overlander thing across the country, it is ideal vehicle for that. Oh, perfect. Yeah, absolutely. It's just beautiful inside. So anyway, that's my little off-road adventure. It was really cool. Love seeing having a different vehicle from a Wrangler out there and kudos. I love it. It's fun seeing a different vehicle, a different Jeep doing Jeep things. Yeah. From the mind of Nicky G. Hey, this is Nicky G. I'd like to remind everybody that the Great Smoky Mountain Jeep Invasion is coming up and it's on the Tennessee side of the Great Smoky Mountains. So in honor of that, I've got five facts that you might not know about Tennessee. It's almost impossible to solve a murder in Tennessee. That's because there's no dental records and everybody has the same DNA. Oh, come on. Oh dear. The governor's mansion in Tennessee caught on fire. He had a whole trailer park burnt down before they could put it out. The most popular pickup line in Tennessee is, hey, nice tooth. It's 20 feet long and only has five teeth. The line at the funnel cake stand at the Tennessee State Fair. And finally, Tennessee officials started a safe sex campaign. Yeah, they put signs on the backs of all the animals that kick. Oh, no. I'd like to remind everybody that this show has an explicit rating. So you knew what you were getting into. Now I got to add Tennessee to the list of states I'm not welcome in. All right, boys and girls, I'll chat to you later. You have a good one. Bye. Fun fact, Al Gore, a Tennessee resident, has a triple wide. It's one of the few triple wide trailers that was ever made. All right. So in our must have stuff pick of the week for your Jeep, and we've gone through this. I'm just going to go with it. I'm going to act like I know what I'm talking about. The Ocean KG 1000G Plus GMRS base mobile two way radio. Now, Larry, I know you have one of these. I believe John Lee and Bill both have this radio as well. Correct. I've never seen one other than yours. But I think this is probably the best GMRS radio out there. It reminds me a lot of the ham radio quality like the icons and the Yezus. And the cool thing is, and I love Midland. Midland has a great radio. They do have a good one. But you can buy this KG 1000G with dual receivers for 350 bucks and 99 cents. So $351 right now. And I think it is a much better overall radio, a 50 watt radio than what Midland sells. What do you think? Yeah, I think it's a really good radio. What I like about it more than anything else is I followed my install off of Bill. You mentioned him here. The fact that you can pull that radio apart. I can mount the body and the receiver in one area. I can mount the face section of it where I do all my selecting in another. And the mic can go a completely different area. And it's all this network cable together. Yeah, and for a Jeep or any small vehicle, having the ability to remove the face and put that in a much more tight spot, it makes it so much nicer. And also too, you have to run an external antenna. Well, I guess you have to, but you should. And you've got to run coax to it. It's just a lot easier with running the power cables and the coax cable. Just someplace where it's a lot easier to keep out of the way and a nice clean install. Now you actually did some 3D printing in conjunction with this radio, didn't you? Yeah, so Bill had followed Bill's install. He actually found a mount that goes over that center section up high on the Jeep. And so it's overhead. Right above the rear view mirror, right? Correct. So I just used my CAD program to design a 3D printed bezel that I could lock the face into. And it just sits there. And I put it just at a little bit of an angle so I could see it and so you could still get to the levers on your freedom panels as well. Now you actually removed that little center section, correct me on this, you actually kind of popped out that center section for Jeep where this thing goes. And you printed the whole thing so it actually pops back into place but holds the face of the wall shunt, correct? So it's almost like a factory install that has the radio right up there. It's really easy to see for both the driver and the passenger. And does the microphone hang down from there? I can't remember. No, the microphone, we actually routed that. It's on the passenger side kick panel. It comes up out of there. Okay. And it hangs on the grab bar for the passenger. That has to be a really slick install. How are you liking the radio and the installation? You know what, I really like that. The radio, I'll be the first to tell you I'm not a big radio aficionado. So for me, it's easy to use and so when I'm going on the highway, I can hit the search real quick and see if anybody's on the radio. And the fact that I could put the actual receiver, I've got it fastened up under the rear seat because I couldn't figure out where to put that thing without it being in the way somewhere. So it's under the rear. Yeah, the main part of the radio, not just receiver but the big box part where the antenna coax and stuff goes into. The mic is over, it's coming up out of the passenger side kick panel and the faceplate's overhead. And I mentioned dual receive, so if you're out on a trail ride, like we've used them before, I remember John Lee says he likes to monitor the more than one group of Jeeps that we always have. So he can literally listen in on, like if he's leading group A, he can listen to group B. And when I get a little too chatty at group B, he can turn that channel down. Right. Oh yeah. You just go to buytwowayradios.com and you can get this Wash On or Ocean KG1000G Plus GMRS based mobile radio for $350.99. Right. You know it's always a little sad when we end the trail or the show, but there's always another trail ride or show just down the road. Jeep Talk Show has four episodes a week and every other week five. Tuesday through Friday on those odd weeks, subscribe and never miss an episode. Oh, and speaking of subscribing, you thought I was going to forget. Consider keeping the Jeep Talk Show on the air by subscribing to the show via Patreon. The place to go for all information on how to subscribe or how to contact us is at jeeptalkshow.com slash contact. You found the show and started listening to all the prior episodes. Just curious, do you listen from the old episodes all the way to the new or from the new episodes back to the old ones? Broadcasting since 2010."}, "podcast_summary": "I think most people listen to the new episodes first and then go back to the older ones if they're interested in the show. It's common for people to start from the most recent episode and then work their way backward to catch up on previous content. However, everyone has their own preference, so some people may choose to start with the oldest episodes and work their way forward. It really just depends on the individual and their personal listening habits.", "podcast_guest": "Melissa with Oracle Lights", "podcast_highlights": "That's great to hear that you've been enjoying the podcast for so long. The order in which people listen to episodes can vary. Some may start from the most recent episode and work backward, while others may start from the beginning and work their way forward. There's no right or wrong way to listen. As long as you're enjoying the content, that's what matters most. Let me know if there's anything else I can assist you with."}