{"podcast_details": {"podcast_title": "The Economist Podcasts", "episode_title": "Checks and Balance: All the committee in China", "episode_image": "https://assets.pippa.io/shows/62e28cad7ca7a10012e46a32/show-cover-updated.jpg", "episode_transcript": " It took until 1843 for a bill mentioning China to come before Congress. It was over trade. The bill instructed President John Tyler to establish commercial relations between the U.S. and the Chinese Empire with national equal reciprocity. It was the year after the first Opium War, and Britain had forced China to open more ports to foreign businesses. America wanted in. The bill gave the President $40,000, about $1.5 million today, to complete the job, but offered no more specific instructions. The whole act barely fills a page. It's just a bit over a hundred words, yet it spurred a trade deal that would last for 99 years. Three decades after it was passed, relations soured when America banned Chinese people from moving to the U.S. Since then, China has sometimes seemed like an opportunity to Americans, and at others seemed like a threat. Today, Congress is almost unanimous that China is a threat. I'm John Pridot, and this is Checks and Balance from The Economist. Each week, we take one big theme shaping American politics and explore it in depth. MUSIC Today, what's next for America's China policy? MUSIC In the months since the spy balloon floated over the Midwest, one of the most important things in the world has been the fact that Washington has been busy debating what to do about China. Arguments continue about whether to engage with the Communist Party or to focus on deterrence. And as the House's Select Committee releases policy suggestions, the Biden administration is forming its own through executive orders. How bipartisan will the next stage of U.S.-China policy be? And what will it look like? MUSIC With me this week to discuss America's relationship with China are Idris Kalloun from Washington, D.C., and Charlotte Howard in New York. Idris, how are you doing? What's been going on in D.C.? I'm doing well. I just got back from California, where I've been reporting about generative AI, and that was very nice, both for weather purposes and for reporting purposes. So, very good to be back. And we had yet another Donald Trump indictment this week from Fulton County, Georgia, which I think is the fourth indictment in five months. Have you been through that one? What did you make of it? I haven't read it closely yet, but I was impressed by the number of people indicted and the fact that the district attorney managed to make use of the RICO standards, which is something that's most commonly associated with mob bosses than former presidents. Yeah, we had a great explainer that our colleague in New York, Annie Crabhill, wrote about the use of RICO in this case. Did I recommend everyone go and read to understand how that law is being applied here? And you haven't asked me how I'm doing yet, John, but I'll tell you... I was getting there....doing well because I was in Washington yesterday and I got to see Idris, who greeted me. I took a very early train at 5.30 in the morning, and Idris kindly greeted me with a flat white on my arrival, which I appreciated. That is the proper way to welcome a fellow bureau chief into town. But we're not going to be talking about Donald Trump this week, because we feel we've done quite a lot on Trump indictments recently, and we'll have to talk about his trials and how they intersect with the Republican primary a good deal over the next few months. Instead, we thought we'd take a look at America's relationship with China, often described as the most important bilateral relationship in the world now, and specifically to look at US-China policy. And in an unprecedented feat of podcast planning, this is part of a double bill with our sister podcast, Money Talks, which is looking at decoupling, or in fact phony decoupling, between the US and the Chinese economies. Idris, this is something you've been reporting on for a little while, and this is an episode you suggested. You've been chatting to people on the Hill who are part of the House's new Select Committee on China. One of the very few ideas on which Democrats and Republicans agree at the moment is pushing back on China. The House Committee, the full, slightly wordy name of which, is the Select Committee on the Chinese Communist Party, was formed earlier this year. It sets out its mission as creating a national consensus on the CCP, which controls China, and working out a response to its growing power. The committee is chaired by Mike Gallagher, a Republican from Wisconsin, and Raja Krishnamurthy from Illinois, who is the ranking member for the Democrats. I spoke to both of them separately earlier this month. The committee has so far been distinguished by its collegiality. Krishnamurthy said that this self-conscious bipartisanship is built into the committee's structure. We've taken the approach where we are investigating and trying to surface the facts before we jump to conclusions about what the right approach should be. And the reason why that's important is because then we can actually agree on what is the current reality and then figure out how do you deal with it. Dealing with it covers a wide range of topics right now. The committee is looking at human rights abuses, the CCP's international influence, including overseas police stations, and the alliance between Vladimir Putin, Russia's president, and Xi Jinping, China's president. But the topic at the forefront, according to Gallagher, is how to rearm effectively in anticipation of a possible conflict between the two great powers over Taiwan. My working hypothesis is that you can actually rebuild our domestic munitions industrial base and pre-position the long-range precision fires and the critical munitions that you need in the Indo-Pacific. What Ukraine has revealed is that our munitions industrial base is too fragile. We've been at minimum sustaining rates for years. We need to go to maximum production rates, and we need to give the primes multi-year certainty and then allow for a non-prime entrance into the munitions business. That connects what Gallagher calls economic statecraft, how to use the American economy to the country's diplomatic advantage and constrain China's rise. The Biden administration is trying this with the CHIPS Act for semiconductors, but Krishnamurthy says other industries might be folded into industrial policy as well. Another tool that we have to kind of refine is what we call, quote-unquote, industrial policy. You know, this is a new animal, so to speak, in U.S. policy, but one that we feel is a tool that has to be used, especially when we're dealing with supply chains that are non-existent or that are in places that are problematic for us right now. And to be able to create the ecosystem here, to incentivize private industry to come here and develop those supply chains, we're going to need to create incentives through industrial policy, kind of similar to what we did with CHIPS and semiconductor items, which has, by all accounts, been more successful than a lot of people expected. So far, the committee has held a series of investigative hearings that put forward reports on how to deter conflict in Taiwan and on the oppression of the Uighurs. Both of the proposals have gotten bipartisan support. But the committee's internal camaraderie isn't enough to get policy through Congress. Recommendations put forward by the committee have to go through the usual process, be passed by the rest of the House and the Senate, and get President Joe Biden's signature, and that's much less congenial. There is a key topic that Gallagher and Krishnamurthy disagree on, how much to keep engaging diplomatically with China. Gallagher, the Republican chair in the committee, isn't a fan of the Biden administration's attempt to resuscitate the relationship after incidents like the spy balloon that drifted over the country earlier this year. What is this renewed diplomatic engagement produced thus far? I mean, are we going to have some agreement on curbing fentanyl precursor shipments? I mean, we have an agreement, a prior agreement on that that bore no fruit. We have yet to set up a crisis communication channel. The Trump administration tried it. The Biden administration has tried it. They don't want to do it. So it seems like zombie engagement is failing in real time to check CCP aggression. And I worry that it's going to send a signal of weakness that emboldens the CCP. I guess the theory underlining this is that the paradox of Marxist-Leninist regimes is that they've become more aggressive as they've become more comfortable. And that right now, particularly given the economic headwinds they're facing, now is the time that you need to continue to increase the pressure, particularly on the economic and ideological domains of competition. If you want actually diplomacy to succeed, that will give you a better chance. Right now, it seems like we're conducting diplomacy unlinked from a credible military deterrent or any sort of coherent economic or ideological competitive strategy. You know, what's the old saying? Diplomacy without armaments, like music without instruments. It doesn't work. This is where Krishnamurthy disagrees. I think what the Biden administration is doing is absolutely crucial. It's appropriate. It's necessary. And we need to be able to communicate to them the information necessary to dispel their misconceptions about us or about facts in general. I think one big misconception they have about us is that they think that we are trying to frustrate the legitimate economic aspirations of the Chinese people. And I can tell you that's not true. I have not heard anybody say we need to put the Chinese people down or even our quarrel is with the Chinese people. So, Charlotte, that was really interesting, I thought. There's a bit of disagreement about the role of diplomacy here in America's dealings with China. But overall, given these are two congressmen from opposing parties, a remarkable degree of agreement, I think. And nice to have Representative Gallagher back on Checks and Balance. I checked our archive and we had him on in 2020 to discuss civil-military relations at the time when Donald Trump was musing about using soldiers to put down protests. What did you make of it? I thought that was a great interview. I mean, it's worth remembering that this was set up by the Republican majority, but the committee was created with a vote of 365 to 65 with some Democrats worried about anti-Chinese sentiment, but largely it had bipartisan support. And the idea just a few years ago that we might be entering a new Cold War with China would have seemed completely bizarre, and yet that's where we are. And so I think what I find most interesting about the policy debate is how you can have policies that are assertive but not escalatory. Is that even possible? And there does seem to be broad consensus that a shift is needed, right? The nature of that shift is hugely complicated, but it's being dealt with in a way that I think, I agree with you, is refreshing compared with how so many other issues are tackled in Washington. I thought it was really interesting to have two congressmen on the podcast in wonk mode. I mean, if you experience American politics primarily through cable news, you would expect members of Congress just to fight with each other all the time and insult each other, but actually, all of us are lucky enough to have done some reporting in Congress. If you get on a slightly nerdy topic that isn't one where there's a big wedge issue between the parties, you can have a pretty thoughtful discussion with some members of Congress. And I think, though, we might not agree with everything that comes out of the China Select Committee, it's sort of an example of Congress working rather than Congress not working, which is the usual mode we talk about. At least last time we were talking about this subject, China had just flown a spy balloon over America. It had been shot down. That had caused a diplomatic incident. The Americans found they couldn't get hold of high-level Chinese counterparts to discuss this over the phone while it was going on. Anthony Blinken's visit was canceled to China or rather postponed. What's happened since then? So you're right. That was a big moment of inflection, particularly after Blinken canceled his visit. And the White House got very concerned about where things were headed. And what we saw in the months since has been an attempt to re-engage with the Chinese and to make the very frosty relations slightly warmer. So as of May of this year, no member of Biden's cabinet had visited China. And then that changed very rapidly. So Bill Burns, the CIA chief, had a secret visit in May that was subsequently reported. Janet Yellen, the Treasury secretary, went and Blinken eventually went as well. I don't know that that will make overall a tremendous difference to the trajectory of the issues that we're talking about, of the economic controls. Those are still ongoing. I think that one thing that Representative Christen Murphy said, which is that America is not trying to constrain China's growth, I think if you look at the reality of what the sanctioned controls are, particularly with semiconductors and high-end chips that are used for artificial intelligence, yes, there's a use for AI in military applications, but a lot of that effect is going to be to constrain the growth of the Chinese industry. And so I think that although the administration and Democrats think that there isn't a kind of containment at foot, some elements of the export controls do read that way. So Charlotte, the Biden administration's answer to your question, which I think is the right question, how does America confront China without increasing the probability of war? The Biden administration's answer is to be really tough, but to engage diplomatically at the same time. And if Congressman Gallagher is representative of the Republican position, that diplomatic effort isn't really worth it, that it's unlikely to bear fruit and just pure toughness is the appropriate approach. I mean, that is a difference, but it's not a huge difference. Yeah, I mean, if you step back, I was struck by the testimony that marked the opening of this committee, which included testimony from Matthew Pottinger and H.R. McMaster, who each at different points were part of the Trump administration. And Pottinger initially set out what I think is the new consensus, which is an understanding that the old optimism in the relationship with China has been broadly accepted as being misplaced. So he had a line about how the CCP presenting itself as a constructive, cooperative, responsible, normal entity was one of the great magic tricks of the modern era. And I do think that view is now broadly held, but there is a difference, right? I mean, going back to Pottinger, he described China as a shark that will never respond unless you build a cage and it's going to keep eating until its nose bumps into a metal barrier. And I think that there is a certain amount of aggressiveness that you hear across Washington that is represented in, for instance, in January 19, House Republicans introducing a resolution that would recognize Taiwan as an independent country. And so Gallagher and this committee are certainly not that far in that direction. They're not saying that Taiwan is independent, but the issue is sufficiently delicate that even small differences in policy and small differences in rhetoric really matter. And politically, it just feels like the pressure, the ratchet, only goes one way, right? I mean, Republicans often criticize Democrats for not being tough enough on China, but if my read is correct, the Biden administration essentially took on quite a lot of the Trump administration's policy, which was tougher on China than its predecessor and made that more orderly and more methodical. I just don't see any upside politically for anyone in Congress at the moment advocating for a slightly softer approach to China. So it just really feels like one way traffic at the moment. OK, we'll go back to another time Congress got involved in China policy in the 1970s in a moment. But first, the usual reminder, we'd love it if you'd take out a subscription to The Economist if you don't already have one. It'll give you full access to all of our journalism. And it's because of our subscribers that we can do all the reporting and writing and podcasting that we do here. So thank you to everyone who already subscribes. And thank you, too, if you're thinking about it. Charlotte and Idris, what have you guys particularly enjoyed from our coverage recently? Because AI has been on my mind, I enjoyed the piece by Guy Scriven, our colleague in San Francisco, who I just saw about the new race for data, which is one of the fuels that you need to power bigger and better foundation, large language models. Our colleague Mike Byrd wrote a really good piece, which I may have mentioned before, but it's worth flagging again on decoupling and how difficult it is in practice. So I'd recommend everyone read that. The other thing I've been following is the fire on Maui. And our colleague Aaron Braun was there reporting on this. And the scale of the devastation is so awful, but Aaron's piece is really worth a read, too. Yeah, I endorse both those recommendations. And if you want even more on the phony decoupling of China and America's economies, then do go listen to our latest Muddy Talks episode. Economist.com slash US pod is the link to subscribe. You'll find it in the notes for this episode. From the moment the Chinese flag was paraded around the arena by a Texan cowgirl, you could tell this was a night that was going to be different. And Vice Premier Deng seemed to enjoy every minute of it. Just outside of Houston, Deng Xiaoping was at his first rodeo. He accepted the gift of a Stetson, delighted in putting it on for the photographers, and waved enthusiastically to the crowd. Then, as if to emphasize what a political showman he is, the Chinese leader went on his own parade in the back of a stagecoach. It was the culmination of a 1979 trip, the first official visit of a Chinese communist leader to America. Deng had a taste of America's greatest hits. He cymed on a lunar rover at NASA, had a state dinner, and even tried Coca-Cola. It was all to mark America and China's normalizing of relations. Good evening. I would like to read a joint communique, which is being simultaneously issued in Peking at this very moment by the leaders of the People's Republic of China. For 30 years, America had recognized the Republic of China on Taiwan as the government of China. But in 1978, President Jimmy Carter announced that Washington and Beijing would establish diplomatic relations. But recognizing the People's Republic meant a changing relationship with Taiwan, as Carter acknowledged when he announced the pivot. The United States recognizes the government of the People's Republic of China as a sole legal government of China. Within this context, the people of the United States will maintain cultural, commercial, and other unofficial relations with the people of Taiwan. The government of the United States of America acknowledges the Chinese position that there is but one China, and Taiwan is part of China. Carter withdrew from the mutual defense treaty with Taiwan, but he tried to reassure Americans that the island would be protected. I have paid special attention to ensuring that normalization of relations between our country and the People's Republic will not jeopardize the well-being of the people of Taiwan. The people of our country will maintain our current commercial, cultural, trade, and other relations with Taiwan through nongovernmental means. Congress was not convinced. In a panel organized by the American Enterprise Institute, a conservative think tank, Senator Bob Dole of Kansas explained his position. I want to develop, as I have indicated, a good relationship with the people, and I hope we can do that. But at the same time, we have to recognize that it's a different government, it's a closed society, it's totalitarian, and we have our own interests. And I'm not so certain, you know, if we go back and look at the precedents, whether the assurances given Taiwan really mean anything. I hope they do. Many members of Congress were also annoyed by how little warning of the change Carter had given them, as Senator Barry Goldwater said in the same panel. And this is what shocked me was to have the president come out without any— he knew of my great interest in this. In fact, he called me one day, he said, I hear you're going to impeach me if I do anything. I said, well, I might, I might try. So he knew I was interested, but he didn't even give me the decency of a call. It wasn't that Congress didn't want to normalize relations with Beijing, but many members were concerned that it sounded like the U.S. might one day let Taiwan be taken back. Although at the time the island was governed by a right-wing dictatorship, it had many allies in Washington. So Congress started working up its own Taiwan policy. The Taiwan Relations Act stated that the United States had to provide Taiwan with defensive weapons and maintain capacity to resist anything that would jeopardize its security or social or economic system. Essentially, it made Taiwan a partner. It also locked in Congress's role in future Taiwan policy. The act was passed with overwhelming bipartisan support, with just four no votes in the Senate. Although some of its provisions at the time felt remote, it has remained in place as the senators hoped it would. I don't fear the invasion of Taiwan by the mainland Chinese for maybe 20 years. If you've ever seen the fortifications on Koumoui, if I were the commanding general and they said, General, we want you to take Koumoui, I would take a rest leave someplace. They're very patient people. They can wait a hundred years, I guess. So Idris, China's economy opened up a good deal under Deng Xiaoping. And for 40-odd years before Donald Trump became president, the mainstream opinion among American presidents and the kind of mainstream policy in America was broadly to welcome China's rise with some caveats during the Cold War as a counterweight to Russia. But after then, there was this optimistic view that China could be integrated into the global trading system and that it would liberalize and become less authoritarian as it became richer. And then Donald Trump comes along and changes all of that. There's been under Obama already in the second term a pivot to Asia and a recognition that the biggest national security threat was not Russia or in the Middle East, but what to do about a rising China. And I think that what Trump did, and he did something very significant, which is to orient both parties in pretty dramatic fashion against China in a pretty kind of swift way. And we see that in a few ways. Both parties now agree that letting China into the WTO was a mistake, that it had negative consequences for America's industrial base. Both parties agree that the idea that liberalizing trade and capitalism would, as a result, lead to democracy was incorrect as well. And now there is a lot more of a realistic recognition about the ability of America to change other countries in our image. We've also seen the strangling of freedom in Hong Kong, which I think has opened the world's eyes to the aims of the CCP. And that naturally has led to worries about Taiwan, which America has a strange one-China policy that it's still used to. All of this has meant that there is an incredible amount of interest from both parties on the Hill in Taiwan and what happens to it. Edwidge, I thought that you wrote really well on this earlier in the year when you were describing the different views, even within the administration. I mean, Ro Khanna, who we heard from last week on the pod, he's a member of this committee that's led by Gallagher and Christian Murphy. And he talks about a spectrum with Donald Trump at one end advocating complete decoupling and Yellen on the other. Janet Yellen, the Treasury Secretary, who is less hawkish, more interested in continued economic engagement. But that divergence that Khanna talks about with Trump and Yellen is present even within the White House, right? I mean, there's Jake Sullivan, the National Security Advisor, who's been much more aggressive than Yellen on this stuff. And he's quite influential. But the set of goals that the administration has here on Taiwan, but also on other issues, is quite a long list. Each of them is hugely difficult, right? So you don't want China to invade Taiwan. You want to deal with climate. You want to limit America's dependence on China for really critical industries and not share American expertise in critical areas, for instance, on semiconductors that have a dual use, so both civilian use and a military one. You see how messy that can be in practice. I think particularly as our colleagues are talking about this week on Money Talks when it comes to the economic sanctions, it's not that you have a small yard with a high fence, which is a phrase the administration has used to talk about just having a few different areas on which they'll impose severe economic restrictions. That yard is widening by the day, right? And it's not clear exactly where this pile up of policies is going to leave America. Is it going to actually be less dependent economically on China? It doesn't really seem like it is if you look beneath the top line numbers. Yeah, I agree. Jake Sullivan, I think, is probably the most important voice in the administration on setting China policy. Certainly his view of China is much more influential within the White House than the Janet Yellen view, which is, I think, a little bit more of classical economists harkening back to the virtues of free trade, which is something that as a publication we very much agree with. But I think doesn't have the political momentum at the moment. I think that there are also other more dovish views within the administration. I think the other probably primary advocate for that end of the spectrum would be John Kerry, who is the climate envoy. And he has this hope that America and China will need to work together in order to help the world decarbonize, not only because of just the sheer volume of emissions from both countries, but also the fact that electric vehicle, clean energy supply chains are going to run through both countries. And it would be ideal if the geopolitical differences could be set aside to allow industries in both countries to grow together. I think that what we've seen, though, is that in the Chinese case, possible shared interests like climate regulation or reducing the supply of fentanyl seem subservient to state interests. So after, for example, the Nancy Pelosi visit to Taiwan, an agreement between America and China over fentanyl was basically suspended. Climate talks also chilled as well. And the Chinese, I think, have a difficulty in dealing with the fractured American system in which you can have actors like Pelosi do their own thing over the objections of the White House, which causes great offense and causes the Chinese, I think, to leave some areas of agreement to the side. I remember talking to Jake Sullivan about this while he was out of office before he went in to serve in the White House. And he made an observation that during the Obama administration, there was a widespread view that in order to make progress on climate change, which was really important, it was necessary not to talk too noisily about human rights abuses in Xinjiang or to talk too much about Taiwan. And the one lesson that people in the Obama administration learned that experience was that China didn't really deal that way. And so I think informed by that experience, the Biden White House is trying to combine extreme toughness on exports of chips and other bits of technology and toughness on Taiwan with trying to work with China on climate. And I think it's fair to say it's not clear yet whether that approach will work either. Okay, we'll be back in a moment to see what China policy Congress is currently working on. Strike! Tell me something I don't know, um. Well, unlike that nasty curveball, there aren't any surprises when you finance your next car with Carvana. You get real terms personalized for you right in your strike zone. Really? STRIKE! How am I supposed to focus when you're telling me about Carvana? Well, slugger, you got to keep your eye on the ball, just like you can keep an eye on your customized down and monthly car payments. I can customize those? He's out and on his way to finance his next car with Carvana. Visit Carvana.com or download the app to get pre-qualified today. We'll drive you happy at Carvana. So Idris, in your conversations with Mike Gallagher and Raja Krishnamurthy, what sounded like the next priority for the select committee? So for Krishnamurthy, the ranking Democrat, what the committee is trying to do is obvious. We never want to have an actual shooting conflict over Taiwan. It would be a very bad day for the world. Not only would there be a global depression, but there would also be thousands and thousands of casualties on all sides. And so the question is, how do you deter this conflict? How do you prevent this from happening? Much of what the committee does is investigate and write detailed policy suggestions about deterrence. They've released a report on how best to arm Taiwan and better defend it from invasion. What we found, even as recent as Ukraine, is that what really staves off an invasion or invader most effectively are asymmetric capabilities, such as javelin anti-tank missiles, man-pads for air defenses. In the case of Taiwan, you would need mines to prevent amphibious landings. Basically, all the things that are necessary to defend territory as opposed to taking more of an offensive posture. From America's standpoint, we need to be able to provide them with a lot of these supplies. Actually getting those arms delivered while also supporting Ukraine is a challenge. Gallagher says working a how-to is a priority for the committee, and that includes reshaping how procurement currently works and working more closely within alliances such as AUKUS, the group with the UK and Australia. It all involves an alphabet soup of military initialisms, including for International Traffic and Arms Regulations, or ITAR, and the Defense Production Act, or DPA. My view is that the most important thing we can do is to stop by a long-range precision fires west of the international dateline where they can target PLA ships. That would be the most dramatic way to enhance our deterrent in the near term, and we're not quite there in the house of probes process right now. So if I were king for a day, I would go all in on multi-year authority and appropriation for critical munitions systems. That would carve out basically an exemption for AUKUS when it comes to Defense Production Act provisions, as well as ITAR regulation. So on the DPA stuff, our amendment would have expanded the definition of a domestic stores to include Australia and the United Kingdom, which both embassies have requested. More arms mean more money at a time when many of Gallagher's conservative colleagues are pushing for a financial restraint, especially on spending over Ukraine. The committee has scoured the budget and found the federal government's equivalent of getting to keep the change. What I'm proposing, we allow the Secretary of Defense the authority to access appropriated but unspent funds going back over the course of the FIDPA. And those range from anywhere between $11 to $25 billion a year for the last five years. It just goes back to the Treasury. It's an own goal. So my theory of the case is by allowing access to that and specifically making it for critical munitions systems, you make that the sort of arsenal of deterrence fund for Taiwan and that provides you all the budgetary flexibility that you need. Beyond increasing arms production capacity, there are other domestic industrial aims, all of which feed into defense. I think that perhaps one area of greater emphasis for us that we need to make is it's not enough to merely play defense, if you will, to try to deal with Chinese intellectual property theft or the CCP's cyber hacking and so forth. We also have to up our game. We have to invest in our people so that they are ready to deal with the technologies of the future, whether it's AI, quantum computing or robotics or nanoscale manufacturing. We have to upgrade our workforce skills. We have to fix our broken legal immigration system, which prevents us from having the best talent to compete with the CCP. And we have to invest in basic science and research to innovate at the frontiers of AI and these technologies of the future. That explains another priority of this committee, which is countering possible Chinese influence already in America. And that's why so much attention has been focused on TikTok, the company owned by ByteDance, which is Chinese and which has seen a massive influx of Americans on its platform. Although ByteDance says that the CCP does not have access to American users' data, there's a growing chorus in Washington that says that it is a security risk. Internal policy for many government devices banned the use of the app. I think that the administration would like to see legislation on this issue. I think that there is movement now within the Energy and Commerce Committee in the House. And I think that there's kind of bipartisan agreement or agreement between Republicans and Democrats who are paying attention to this issue that something has to be done. Because what we know is that ByteDance, which owns TikTok, absolutely has to comply with the national intelligence law, the national security law of China, which requires them to both provide data upon request and to embed the CCP within the company and its leadership. And that's what they've done. And so I don't believe in necessarily banning TikTok, but forcing a sale to another entity seems appropriate. For Gallagher, though, there are plenty of things still moving too slowly and that the committee alone can't rectify. There's no plan to rebuild the Navy right now. Under the Biden administration plan, the Navy is going to bottom out at 2027, at 279 ships, which happens to coincide with the year that Xi Jinping has set for his military to be ready to take Taiwan. So, Charlotte, really interesting to hear some more from both those congressmen. And it's maybe useful to point out that Mike Gallagher is a military veteran. He served in Iraq. So he's particularly focused on military capability. And that might be one reason why. There's a fair bit of agreement there, as there is across this select committee. But what do you think the results of that bipartisan agreement will actually be? I mean, there's been a lot of talk about TikTok in state legislatures and about a TikTok ban in Congress. Do you think that's something that would actually happen? It doesn't have the authority to introduce legislation. But the intent of the committee is to issue recommendations that then filter into future legislation. So the first big opportunity for that this year was the National Defense Authorization Act, which is something that is passed each year. And you saw Gallagher cheer a few measures in there, but there was nothing so dramatic. The House committee had recommended, had issued a series of recommendations on Taiwan back in May that included a whole range of different provisions, including a big investment in the US defense manufacturing base. I think that is something that will come, but it's not evident yet. So I'm not sure that the measure should be, is legislation necessarily going to pass this year on any of these really big issues, but rather there's increasing support on both sides of the aisle and that may result in something maybe next year, or maybe the year after, but the direction of travel in my mind is very clear. I was really struck, though, also by the inquiries that the committee is pursuing. So for instance, BlackRock, which has US indices that contain holdings of certain Chinese companies with links to the military. There also is an inquiry into UC Berkeley for its program. It has a program with a university in China. So you see the range of activities that used to be considered somewhat normal now increasingly called into question. And so there is the impact on legislation, but there also, I think, is a different kind of impact that the committee can have on American activities through the role of its inquiries and the investigations that it launches. There's definitely a lot of interest in either forcing a sale of TikTok or banning it outright. We've seen bipartisan bills introduced by people like Senator Mark Warner to that effect, but it's been slow in terms of actually happening. And I think that's a pattern you see across the board. There are bunches of legislation that have been proposed, some fairly small borr issues that seem to have a lot of bipartisan agreements, such as funding cybersecurity efforts for Taiwan. There's a lot of agreement on providing munitions to Taiwan. That stuff appears to be pretty slow moving. And I think that that is something that you'll see continue to your point. I think that with the NDA that's coming up, there probably will be some bipartisan agreement on sending money to Taiwan. But I think members of the committee might disagree by party on the cuts that are being proposed to State Department and other institutions where Democrats will argue that by limiting the resources given to America's diplomatic core, that you are actually making it more likely that there will be conflict in Taiwan and that a military only approach is not going to be the right one. But it is also interesting to me that this NDA debate is going to hinge quite a lot on additional money to Ukraine. And a lot of Republicans are very resistant to that. It'll be interesting to see how Republicans make their arguments because there's one wing of the America First coalition that is purely isolationist and says that basically this isn't America's issue at all in either place. And then there's another contingent that says that the reason that there needs to be less money for Ukraine is that there needs to be more money for Taiwan to deter Chinese aggression. So it'll be interesting to see how that plays out as well. You also had just last month the White House authorizing for the first time donations of weapons to Taiwan. As much as America gives weapons to Ukraine, it now gives weapons to Taiwan as well, which is the first. I think one thing that came out of your interview that I found interesting is the question of industrial policy. Because CHIPs, the big bill that passed last year, that did have bipartisan support because of the national security implications. And you could think about all other manner of areas where America remains deeply dependent on China, including pharmaceuticals, and the difficulty of disentangling a pharma supply chain from the active pharmaceutical ingredients that are produced in China. It's just one example of why I think you're not going to see more aggressive industrial policy coming through legislation. I wouldn't be surprised if there were more restrictions that came through executive action, but at least the legislative route to continued economic decoupling or attempts at economic decoupling seems to have run its course for now. There was something that came up in the interview that I think is heartening if we, and I'm speaking for Americans, could actually get our act together, which is the emphasis that Krishnamurthy placed on basic science, on investing in training and education and all that as a long-term competitive priority for America. And I think one of the few good things that could come of this period of extreme uncertainty is if some of those types of investments, which can be discarded as not being a top priority, become more prioritized because there's an increasing recognition that America's security and competitiveness depends on it. I have a question for both of you. Idris, your analogy with Ukraine prompted it. Do you think there's a sense in which Congress is trying to Trump-proof China policy here? I mean, we heard earlier when we're looking back at American history in the 1970s, sometimes when Congress doesn't quite trust the president, it grabs power for itself and sets policy. I wonder if you might see something similar on China policy, because although Donald Trump was extremely tough on China rhetorically when he was in the White House, I think there is some unease, let's say, among American China hawks about what a return of Donald Trump to presidency would mean for Taiwan specifically. I think that's a really interesting question, and it goes to the point of whether rhetoric matters. So I guess there are two things. One is I don't think if Trump were to be president, anyone trusts him to speak in a measured way. And then the second is, would he be able to have policies that are constrained either by his advisors or by Congress? Interestingly, Joe Biden also has the same rhetorical problem where he sometimes seems to misspeak. And one thing I'm really interested in is how both candidates talk about China evolves over the course of the campaign, because I think that Biden and his advisors right now are trying to be a bit more measured. But I think it is politically advantageous to both Donald Trump and to Joe Biden to be more aggressive. I was struck by some polling on this. I mean, the public perceptions of China have taken such a dramatic turn since 2018. The percentage of Americans who view China unfavorably rose by 45 percent in that year to 84 percent in a recent Pew poll. And interestingly, there's this really weird partisan overlap where the most lefty voters and the most conservative Republicans are the people who are most concerned, for instance, about China's human rights record. And so I think that there's a real risk that what's in the interest of a campaign rhetorically is not in the interest of the country. And the way that Trump speaks when in office is always with the tone of a campaigner. And I think that that matters. What do you think, Idris? Yeah, you know, it's pretty clear to me what a Trump victory in 2024 means for Ukraine. It means immediate capitulation. What I don't know, and I keep asking people and the people I ask don't know also, is what a Trump victory means for Taiwan. On the one hand, he was the progenitor of a lot of the hawkishness in America towards China. And on the other, if there is anything that he believes to his core, it seems to be an aversion to committing American troops abroad. And we also see that he sometimes will flip and cut deals and try to make nice with distasteful people like Kim Jong-un. So I don't know whether a Trump victory means war or whether it means that Taiwan gets sold down the road for a few bushels of soybeans. I don't know. If anyone has a clear idea, I'd be all ears. This topic can be a bit alarming, so I want to try and end on a slightly more upbeat note. It would be really nice to think that America's government and China's government could have warm relations. But that is very hard, given the character of China's current government, given that it's a communist autocracy with a terrible human rights record. And given that, the status quo where we are at the moment, in which America is confronting China, but also keeping diplomatic relations open, China hasn't invaded Taiwan. And yes, there has been a change to the global trading system. But actually, America and China and all the countries that trade with them are knitted together. Still, it seems to me that things could be a lot worse than that. I mean, the global trading system hasn't crashed. The world economy hasn't been sent into a depression by confrontation between the two powers. So I'm not sure if this equilibrium is stable. But if it is, I think I would take that, given how bad some of the alternatives could be. OK, let's leave that there for now and have a quiz. This is unsurprisingly China-themed. Question one. We mentioned Deng Xiaoping's visit to America in 1979 a bit earlier and the state dinner that was held in his honor. That dinner marked the first official return to the White House of whom? Of Richard Nixon. Well done. Is the right answer. Nixon's presence was criticized as an attempt to rehabilitate the former president. But the Chinese delegation had insisted that he be there. One mark to address. Question two. Nixon was famously the first sitting president to visit China. But who was the first to visit France as president? John Adams? I would guess Jefferson. He loved the French, didn't he? Yeah, I think he was there before he was president. It's a lot later than I would have guessed. The answer is actually Woodrow Wilson in late 1918. No one went. For the initial discussions before the Paris Peace Conference the next year. So yeah, Wilson was the first one apparently to visit as a sitting president. Interesting. I would have guessed much earlier. I guess it took a while to go to France back in the day. I guess so. There was one president who spoke Chinese. Who was it? Who was that? I have no idea. I feel like it was, I feel like it might have been a 19th century one. But I have no idea. That doesn't rule many out. Tell us. Who was it? It was Herbert Hoover. He was an engineer in China. Interesting. I did know that. He spoke limited Mandarin to his wife. He built railways in China, didn't he? Yeah. Yeah, I should have known that. That's annoying. That's a good factoid. Okay, I will forget it by the time the next quiz comes around. But thank you for that. Next week will be our book club episode. So do tune in for that. That's the most important thing that's happening in American politics next week. The second most important thing is that it's the first Republican primary debate. So Idris and Charlotte, what will you be looking out for in that? Will Trump show up? Yeah. How does Ron DeSantis do on stage? The other one? I think a big question also is just the extent to which people are willing to throw Trump under the bus or make themselves subservient to him, which is always a challenge for the Republican Party as far as I can see. The thing I'll be watching for is whether the candidates on stage can talk about anything other than Trump's four indictments or whether the Republican primary just gets entirely taken over by that issue. Well, that's it for this week. Thank you, Idris. Thank you, Charlotte. Thank you. Thank you. This episode was produced by Harriet Noble and Stevie Hertz. James Stickland is our sound engineer. If you like the podcast, then please let people know and leave us a rating and a review. You can now find every episode of Checks and Balance in one place at economists.com slash chexpod. We also have a Checks and Balance newsletter. You can sign up for that at economists.com slash newsletters. And you can get in touch with us via email. We really like hearing from you. So please keep those emails coming. The address is podcasts at economists.com. In the meantime, thanks very much for listening. Stay safe. Stay sane. We'll have more Checks and Balance next week. Thank you."}, "podcast_summary": "In this episode of Checks and Balance from The Economist, the focus is on America's China policy. The podcast discusses the bipartisan agreement in Congress that China poses a threat and explores the different perspectives on how to deal with the rising power. The House's Select Committee on China is mentioned as a platform for developing policy recommendations, and the episode features interviews with Mike Gallagher, a Republican from Wisconsin, and Raja Krishnamoorthi, a Democrat from Illinois, who are both members of the committee. The interviews highlight the importance of deterrence in preventing conflict with China, the need to invest in the domestic munitions industrial base, and the challenge of countering Chinese influence in America. The podcast also discusses the challenges of navigating economic decoupling and the complexities of engaging diplomatically with China. Overall, the episode provides a comprehensive overview of America's current China policy debate and the various factors shaping it.", "podcast_guest": "Idris Kalloun", "podcast_highlights": "That's the end of the podcast highlights."}