{"podcast_details": {"podcast_title": "Johnjay & Rich: After Words", "episode_title": "New Character Alert: Kyle's PERSONAL MATTRESS Expert", "episode_image": "https://d3wo5wojvuv7l.cloudfront.net/t_rss_itunes_square_1400/images.spreaker.com/original/e35936706b5983768583e666b1803742.jpg", "episode_transcript": " All right, we're gonna start the podcast right now. We're gonna pick up Kyle's brother-in-law because Kyle's husband sent me a text about a bed that he bought, and now my bed's broken, and I wanna buy this new bed, and it seems really expensive, but Kyle, your brother-in-law said it was great. Yes, so my brother, Brock, are you there? Yeah, I'm here. Does everybody mean Brock? Hi, Brock. Bedding with Brock. What's up, guys? It's a new segment, Bedding with Brock. Can you walk us through this bed, please? Explain it to me, to everybody, and is it worth it? Yeah, and I didn't buy, they've got two things you can do. You can actually get the bed, or you can get what's called the pod, which is just a cover that goes over the bed because the bed, they say, is pretty squishy. Our bed's firm, so we just got the pod, but it's called an eight-sleep, and it's this little box that you put next to your bed, plugs into the pod, or if you get the full bed, it plugs into it, and then you hook your phone up to it, and it runs your, changes your temperature, pumps cool water or heated water through it. My wife and I, every night, we turn our AC down to like 65 degrees. You wake up freezing, she'd have four blankets on, I'm sweating, so her side, she sets to her. My side, I set to me, and it's been, I mean, we've had it probably a month and a half now. It's the best sleep that I've got. There's no more fighting with her over all this stuff. Yeah, that's a big problem in my house. That exact same thing, but I mean, I keep my room 67. That's so cold, you guys, why? 65 is baller, bro, that is fantastic. I know, it was great until the morning, when you get up and you go, I am so cold, and I gotta go across the tile floor. Yeah, now, why did you get this thing? How did you hear about it? I don't know how the social media know I need anything, but it just popped up one day, and I started doing research, and there's a bunch of other ones out there, but this one seemed like it was the lowest maintenance, and it's got this app, so you sleep on it for a week, and it'll adjust your temperature throughout the night. Like when you're in REM sleep, it'll pump it up a couple degrees. In deep sleep, it changes it, and then you set. When you're going to bed, when you're waking up, so it'll start cooling your bed an hour beforehand. You can even program it to start warming up in the morning when you wake up, so you wake up better. Okay, so what about when you say your phone, is your phone by the bed then? No, it's all on your WiFi. I could be out of town and program it. Okay, just because I don't want my phone near my bed, so I wanna make sure that when you say that. Yeah, no, no, no, no. That's just how you control it, because you each log on and do your own thing there. What about the water though? How do you get the water up there? Do you gotta put it on the pod before you brew? So there's a little machine that sits right next to you, and it's super quiet. It's right next to my head. We don't hear it at all. And that's what you plug in, and it runs through. It also has a bunch of sensors in it, so it gives you your telematics. Like you slept terrible last night. You got eight and a half hours sleep. 27 of that was REM sleep. 47 minutes was deep sleep. It does, I used to wear a loop and looked a lot into that heart rate variability. You know what I'm talking about? HRV, HRV, I was talking about HRV today. Wow. That's, it's the best. So this thing has sensors, and it tells you how much your heart rate variability, what your resting heart rate was. Like it gives you all this data. That's what the Oura Ring does then. Do you have an Oura Ring? Yeah, same print. Where did you come from? I don't like wind. How is this the first I'm hearing of this incredible man named Brock? I know, no, Brock's awesome. Brock knows so much about so many things. Yeah, but are you currently obsessed with sleep? Because I am, and it sounds like you are, or it's just a fun thing you do on the side, because that's incredible. On the side. I've researched so much, I could have gotten it off this one conversation with you. I've been doing so much research on sleep to the last, like I cold-punched just because it's supposed to help you sleep better. Yeah, same here. It's a big cold-punch. You found your match, John Jay. Brock, where do you cold-punch? In my garage. Did you? In my garage. You put one in? Yeah, I actually built one out of an old chest-freezer. Oh, smart. So let me tell you what I learned about cold-punch. You cold-punch in the daytime, in the morning to get your body cold, and then what you wanna do is you want a hot tub before you go to bed, because then your body's trying to cool down, and that's supposed to help you sleep better. Get building that, Brock, let's go. Yeah, yeah. First thing, I wake up in the morning cold-punched. Okay, because I used to cold-punch before I went to bed because someone said it was supposed to help you sleep, but it didn't, it just got me out of public. They're comparing cold-punches to doing cocaine. What, with that energy? The same dopamine level as cocaine. Really? When I just do cocaine, I got some in my garage. I know. Not good for you. Jokes, not just jokes, just jokes. Yeah, right, don't recommend that at all. So is it easy if I was to get to sleep aid thing? Because I already, like, if there's certain obstacles, like I don't- John Jay doesn't wanna put in any effort. Yeah, I don't do the IKEA thing. And really, his routine to go to bed is pretty extreme already, I feel like. I would love that cold thing. It sounds perfect for me. I just don't wanna do it. It was super simple. Like, unpack it, do the pod on, hook the hose up, and then download the app, and it primes, like you gotta put distilled water and hydrogen peroxide in the little thing. And then it- Yeah. Blake would do that. Okay, leave me alone for an hour, come back and add more. And then I had to do that twice. I mean, total work time is like 15 minutes. And that's it for the rest of your life? That's, you don't have to change it out or anything? So I did the research. The other ones, you're supposed to redo the water every two months or something. This one, it says it'll let you know, and it's supposed to be super simple, but it's like once a year. Okay, how much did it cost, by the way, the pod? It's not cheap. I think ours are like $2,200. Dang. What's that even, the mattress? That's just the cover. It's the pod, yeah, it's the cover. Jeez. Yeah, I think the mattress is another thousand bucks on top of that. My, oh my. So why would you want the mattress if you can get the same thing doing what you're doing? I wouldn't. Oh, so you don't want, like if they offered you the mattress, you're like, no thanks, I'm really happy with this. You should be consulting Brock. Yeah, yeah. But like, you should do like- Wait, wait, wait, wait, wait, wait, say that again. Because he said, he said the original, their bed is like really squishy, and they like a firmer bed, which is why they wanted the pod. Right, so the eight-sleep mattress is mushy, and I don't like a mushy mattress. Yeah, I love a mushy mattress. No, I do. Yeah. We like a firm. You should recommend a pairing, like a sommelier, he's like a sleep pod sommelier. Eight-sleep sommelier. You get the mattress, this mattress, with this top and you'll sleep good. Yeah, yeah, take the silly posthopedic Model 17 with a fine pairing of the sleeping. Which sister, is Brock's married to your sister? Yeah, Heather. Oh, Heather, oh yeah. We live in Colorado. Old Heather. Old Heather. She's still in Orange Theory? She is. Oh yeah, yeah, Coach Heather. Coach Heather. She's there right now. Well, that's the other thing, she gets up at like 3.30 in the morning, and it was just disrupting my sleep, so it's programmed out that it drops a couple degrees when she gets up to help me go back to bed. So she likes it, does she cold plunge too? No, she hates the cold. Yeah, so- Oh, here's the crazy thing, Jodjie. If I roll over to kiss her at night, her bed is probably 15 degrees hotter on her side. That's wild. That's how mine is. That's so wild. She runs it hot, I can't stand that. How long have you been married to Heather? 22 years. Okay, so then tell us something about Kyle we don't know. So you've known Kyle forever. Yep. Yeah, I know enough not to get on Kyle's side. Oh, yeah, you do, Kyle. Wow. If you keep Kyle cool, everything's good. Smart man. Smart man. Yeah. If you don't cause any problems with Kyle, she's always good. But if you do- Yep, yep. Brock, I love ya. Brock, thanks for jumping on the podcast with us, man. Appreciate it. Yeah, absolutely. You know, we'll send this to the sleep aid people. Maybe they'll be like, let's send this Brock guy to bed. We should. Yeah, maybe they'll send you a free one, man. I'll send one to you too. Yeah, yeah, it's good. I'm gonna do it. I'm gonna do a little bit more research. What? You could even set an alarm on it where it'll pulse the path to waking up. What? Bro, I can't even work the alarm on my phone. Yeah. I can't, it's- Well, as early as you guys get up, man, you'd set 10 visual alarms probably. Yeah, for sure. All right, Brock, take care, man. Thanks for jumping on the air. All right, guys. Talk to you later. We should have the sleep doc on again. I know. As good as that podcast was, I bet we only covered like 1 one hundredth of all the stuff that he knows about getting good sleep. Well, Brock guy seems like, I have a visual of what he looks like. What's he look like? You wanna see a picture? Yeah, but first I have a visual of what he looks like. Okay, tell me what you think he looks like. Like a surfer guy kinda. Oh, really? Blonde hair or brown hair? Shaves his head? Yeah, I think he's got short cropped hair. That was my visual. I didn't say he shaved his head. No, I'm just, that was my visual. Oh, no, I figured he's like a surfer guy with blonde hair. Less of a surfer, more he skis and bikes. Yeah, he totally like, that's Brock? Uh-huh. Well, I did not see that. That's how I envisioned Brock. What are those? Oh, Brock. Are those coconuts? They were like coconuts. That was like a vacation picture. Yeah, he seems like a, I mean, the fact that he, so he gave up the whoop and it's all in that mattress. That mattress seems incredible. Just don't wanna, I don't want a mattress with a lot of work. It doesn't sound like it. It sounds like the initial setup. Yeah, but I don't do that. But you have your handyman do it. Yeah, but you know if you were like, yeah, I know, also, if you were like, Blake, will you set this up for me? I'm sure she'd be able to do it. And I'm sure your kids could probably do it for you too easily. Yeah. He said it was called Sleep Eight. Eight Sleep. Eight Sleep. Yeah. No, he said ape, like a monkey. Ape, no. Ape Sleep. Ape. He's like, look at ape. Oh, that sounds great. You always see them sleeping at the zoo. You do. Knocked out. Yeah, I'll do that. Wake up, throw a little poo, and you're good. I wonder what it's called, eight. I wonder what it's called, Sleep Eight. Is it eight hours? Maybe. Sleep eight hours? Well, maybe. I mean, that's our little podcast. This isn't a commercial at all. I mean, it might seem like one, but it's not. We're just investigating. That's what we do on the show, investigate. If you have a product you want us to investigate, let us know. But you have to own the product and tell us about it. And your name has to be. So how are we investigating? The same first letter. Like Brock Spedding. Yeah. So it's going to have to be like Patty's Pot, so she wants cooking advice. Yeah, right."}, "podcast_summary": "In this podcast episode, the hosts discuss a new bed called Eight Sleep that is designed to improve sleep quality. The bed consists of a mattress and a pod, which is a cover that goes over the bed. The pod connects to a small device that can be controlled through a mobile app. The device adjusts the temperature of the bed by pumping cool or heated water through it. Users can set different temperatures for each side of the bed, allowing for personalized comfort. The device also tracks sleep data, such as heart rate variability and time spent in different sleep stages. The hosts discuss their experiences with the bed and praise its ability to improve sleep quality and reduce conflicts over temperature preferences. The bed is relatively easy to set up and requires minimal maintenance, with the water needing to be changed only once a year. However, the bed is quite expensive, with the pod alone costing around $2,200. The hosts also mention the benefits of cold plunging before bed to help with sleep, and one of the hosts jokes about using cocaine for energy. Overall, the hosts recommend the Eight Sleep bed for those who prioritize good sleep and are willing to invest in a high-quality sleep experience.", "podcast_guest": "Brock", "podcast_highlights": "Highlight 1: \"My wife and I, every night, we turn our AC down to like 65 degrees. You wake up freezing, she'd have four blankets on, I'm sweating, so her side, she sets to her. My side, I set to me. It's the best sleep that I've got. There's no more fighting with her over all this stuff.\"\n\nHighlight 2: \"Just because I don't want my phone near my bed, so I wanna make sure that when you say that. Yeah, no, no, no, no. That's just how you control it, because you each log on and do your own thing there.\"\n\nHighlight 3: \"There's a little machine that sits right next to you, and it's super quiet. It's right next to my head. We don't hear it at all. And that's what you plug in, and it runs through.\"\n\nHighlight 4: \"It has a bunch of sensors in it, so it gives you your telematics. Like you slept terrible last night. You got eight and a half hours sleep. 27 of that was REM sleep. 47 minutes was deep sleep.\"\n\nHighlight 5: \"So I did the research. The other ones, you're supposed to redo the water every two months or something. This one, it says it'll let you know, and it's supposed to be super simple, but it's like once a year.\""}